---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisResultSchema.GetUnitsMultiplier(System.Int32)
source: html/27913e0a-f5f2-f6f9-db1e-ace7c1f74537.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisResultSchema.GetUnitsMultiplier Method

returns units multiplier by index

## Syntax (C#)
```csharp
public double GetUnitsMultiplier(
	int index
)
```

## Parameters
- **index** (`System.Int32`) - index of unit in the list